docs/mediciones/perf/k6-console-auth-cold-run1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-cold-run1.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.5s/30s

running (0m03.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.5s/30s

running (0m04.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  02.5s/30s

running (0m05.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.5s/30s

running (0m06.0s), 50/50 VUs, 178 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  04.5s/30s

running (0m07.0s), 50/50 VUs, 217 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  05.5s/30s

running (0m08.0s), 50/50 VUs, 256 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.5s/30s

running (0m09.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  07.5s/30s

running (0m10.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  08.5s/30s

running (0m11.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.5s/30s

running (0m12.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  10.5s/30s

running (0m13.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  11.5s/30s

running (0m14.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.5s/30s

running (0m15.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  13.5s/30s

running (0m16.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  14.5s/30s

running (0m17.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.5s/30s

running (0m18.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  16.5s/30s

running (0m19.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  17.5s/30s

running (0m20.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.5s/30s

running (0m21.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  19.5s/30s

running (0m22.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  20.5s/30s

running (0m23.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.5s/30s

running (0m24.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  22.5s/30s

running (0m25.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  23.5s/30s

running (0m26.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.5s/30s

running (0m27.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  25.5s/30s

running (0m28.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  26.5s/30s

running (0m29.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.5s/30s

running (0m30.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  28.5s/30s

running (0m31.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  29.5s/30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 2900 out of 2900
     data_received..................: 1.3 MB  40 kB/s
     data_sent......................: 1.5 MB  47 kB/s
     http_req_blocked...............: avg=36.9µs  min=2.02µs  med=9.45µs   max=3.54ms  p(90)=25.23µs p(95)=56.8µs  
     http_req_connecting............: avg=15.86µs min=0s      med=0s       max=2.49ms  p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=41.68ms min=8.76ms  med=23.85ms  max=1.31s   p(90)=94.63ms p(95)=140.19ms
       { expected_response:true }...: avg=41.68ms min=8.76ms  med=23.85ms  max=1.31s   p(90)=94.63ms p(95)=140.19ms
   ✓ http_req_failed................: 0.00%   0 out of 1453
     http_req_receiving.............: avg=1.55ms  min=39.71µs med=701.62µs max=75.06ms p(90)=2.52ms  p(95)=4.32ms  
     http_req_sending...............: avg=71.76µs min=5.93µs  med=31.6µs   max=13.31ms p(90)=105µs   p(95)=172.57µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=40.05ms min=7.74ms  med=22.76ms  max=1.3s    p(90)=93.91ms p(95)=135.75ms
     http_reqs......................: 1453    45.674604/s
     iteration_duration.............: avg=1.04s   min=1s      med=1.02s    max=1.25s   p(90)=1.09s   p(95)=1.13s   
     iterations.....................: 1450    45.5803/s
     vus............................: 50      min=0            max=50
     vus_max........................: 50      min=50           max=50


running (0m31.8s), 00/50 VUs, 1450 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s