docs/mediciones/perf/k6-console-auth-cold-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-cold-run2.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  00.4s/30s

running (0m03.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.4s/30s

running (0m04.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  02.4s/30s

running (0m05.0s), 50/50 VUs, 123 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  03.4s/30s

running (0m06.0s), 50/50 VUs, 169 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  04.4s/30s

running (0m07.0s), 50/50 VUs, 216 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  05.4s/30s

running (0m08.0s), 50/50 VUs, 254 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  06.4s/30s

running (0m09.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  07.4s/30s

running (0m10.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  08.4s/30s

running (0m11.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  09.4s/30s

running (0m12.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  10.4s/30s

running (0m13.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  11.4s/30s

running (0m14.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  12.4s/30s

running (0m15.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  13.4s/30s

running (0m16.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  14.4s/30s

running (0m17.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  15.4s/30s

running (0m18.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  16.4s/30s

running (0m19.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  17.4s/30s

running (0m20.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  18.4s/30s

running (0m21.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  19.4s/30s

running (0m22.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  20.4s/30s

running (0m23.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  21.4s/30s

running (0m24.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  22.4s/30s

running (0m25.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  23.4s/30s

running (0m26.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  24.4s/30s

running (0m27.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  25.4s/30s

running (0m28.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  26.4s/30s

running (0m29.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  27.4s/30s

running (0m30.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  28.4s/30s

running (0m31.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  29.4s/30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 2900 out of 2900
     data_received..................: 1.3 MB  40 kB/s
     data_sent......................: 1.5 MB  47 kB/s
     http_req_blocked...............: avg=29.54µs min=2.04µs  med=9.68µs   max=2.28ms   p(90)=25.26µs  p(95)=80.65µs 
     http_req_connecting............: avg=6.99µs  min=0s      med=0s       max=951.46µs p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=40.9ms  min=9.53ms  med=29.25ms  max=1.35s    p(90)=74.58ms  p(95)=105.87ms
       { expected_response:true }...: avg=40.9ms  min=9.53ms  med=29.25ms  max=1.35s    p(90)=74.58ms  p(95)=105.87ms
   ✓ http_req_failed................: 0.00%   0 out of 1453
     http_req_receiving.............: avg=1.23ms  min=29.89µs med=698.99µs max=17.19ms  p(90)=2.77ms   p(95)=4.59ms  
     http_req_sending...............: avg=68.48µs min=4.97µs  med=32.73µs  max=5.08ms   p(90)=118.57µs p(95)=174.02µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=39.6ms  min=9.29ms  med=28.16ms  max=1.35s    p(90)=71.8ms   p(95)=104.42ms
     http_reqs......................: 1453    45.574124/s
     iteration_duration.............: avg=1.04s   min=1.01s   med=1.03s    max=1.22s    p(90)=1.07s    p(95)=1.1s    
     iterations.....................: 1450    45.480028/s
     vus............................: 50      min=0            max=50
     vus_max........................: 50      min=50           max=50


running (0m31.9s), 00/50 VUs, 1450 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s